# GetElementsBeingCut Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
InstanceVoidCutUtils..::..GetElementsBeingCut Method
InstanceVoidCutUtils Class See Also
---
Return ids of the elements being cut by the instance
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static ICollection<ElementId> GetElementsBeingCut(
	Element cuttingInstance
)
```

Visual Basic
---
```text
Public Shared Function GetElementsBeingCut ( _
	cuttingInstance As Element _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
static ICollection<ElementId^>^ GetElementsBeingCut(
	Element^ cuttingInstance
)
```

# ### Parameters
cuttingInstance
    Type: Autodesk.Revit.DB..::..Element The cutting family instance
# ### Return Value
Ids of elements being cut by cuttingInstance
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
InstanceVoidCutUtils Class
Autodesk.Revit.DB Namespace